# Parameter Type Id Rotate Angle Property

Source: https://www.revitapidocs.com/2026/e19b6265-ddcf-f6c1-cb83-0d8ecb42ca14.htm

---

| Parameter Type Id Rotate Angle Property |
| --- |

"Rotation Angle"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RotateAngle { get; }
```

```
Public Shared ReadOnly Property RotateAngle As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RotateAngle {
	ForgeTypeId^ get ();
}
```

```
static member RotateAngle : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace